Repository: gzwplato/fbdebugger
Catalog: src/locale/*/LC_MESSAGES/fbdbg.po
Languages: de

source: callback act_Settings
de: Rückruf-Funktion act_Settings

source: callback act_Settings -> get changed settings
de: Rückruffunktion act_Settings -> ermittle veränderte Parameter

source: callback act_Settings -> dialog canceled, restore form
de: Rückruffunktion act_Settings -> Dialog abgebrochen, Formular wiederherstellen

source: --> callback act_Shortcut
de: --> Rückruffunktion act_Shortcut

source: callback act_Shortcut -> get changed settings
de: Rückruffunktion act_Shortcut -> lese veränderte Parameter

source: callback act_Shortcut -> dialog canceled, restore form
de: Rückruffunktion act_Shortcut -> dialog abgebrochen, Formular wiederherstellen

source: callback act_ToDo
de: Rückruffunktion act_ToDo

source: callback act_attachexe
de: Rückruf-Funktion act_attachexe

source: callback act_auto
de: Rückruf-Funktion act_auto

source: callback act_exemod
de: Rückruf-Funktion act_exemod

source: callback act_fastrun
de: Rückruf-Funktion act_fastrun

source: callback act_files
de: Rückruf-Funktion act_files

source: callback act_free
de: Rückruf-Funktion act_free

source: callback act_help
de: Rückruf-Funktion act_help

source: callback act_kill
de: Rückruf-Funktion act_kill

source: callback act_memory
de: Rückruf-Funktion act_memory

source: callback act_minicmd
de: Rückruffunktion act_minicmd

source: callback act_multiexe
de: Rückruf-Funktion act_multiexe

source: callback act_notes
de: Rückruf-Funktionact_notes

source: callback act_restart
de: Rückruf-Funktion act_restart

source: callback act_run
de: Rückruf-Funktion act_run

source: callback act_runto
de: Rückruf-Funktion act_runto

source: callback act_source
de: Rückruf-Funktion act_source

source: callback act_step
de: Rückruf-Funktion act_step

source: callback act_step_end
de: Rückruf-Funktion act_step_end

source: callback act_step_out
de: Rückruf-Funktion act_step_out

source: callback act_step_over
de: Rückruf-Funktion act_step_over

source: callback act_step_start
de: Rückruf-Funktion act_step_start

source: callback act_stop
de: Rückruf-Funktion act_stop

source: callback act_varproc
de: Rückruf-Funktion act_varproc

source: --> callback on_accel_cleared
de: Rückruf-Funktion on_accel_cleared

source: --> callback on_accel_edited
de: Rückruf-Funktion on_accel_edited

source: Select file
de: Datei auswählen

source: Executables (*.exe)
de: Ausführbare Dateien (*.exe)

source: Save file
de: Datei speichern

source: Comment
de: Kommentar

source: Website
de: Internetseite

source: Run to Cursor
de: Ausführen bis Cursorposition

source: Execute the debuggee up to the cursor position
de: Ausführen bis zur nächsten Cursorposition

source: Next step
de: Nächster Schritt

source: Execute the debuggee step by step
de: Schritt f. Schritt ausführen

source: Step over procs
de: Springe über Prozedur

source: Step over a SUB or FUNCTION
de: Springe über SUB od. FUNCTION

source: Step out current proc
de: Verlasse aktuelle Prozedur

source: Exit the current SUB or FUNCTION
de: Bearbeite aktuelle SUB od. FUNCTION

source: Run
de: Ausführen

source: Run until halt
de: Ausführen bis Halt

source: Fast Run
de: Schnelles Ausführen

source: Halt running debuggee
de: Stoppe laufendes Programm

source: Halt running program
de: Stoppe laufenden Prozess

source: Kill debuggee
de: Lösche Programm

source: Variable Dump
de: Variablenanzeige

source: Edit var value
de: Bearbeite Variable

source: Show/Expand variable
de: Zeige/verberge Variablen

source: Shortcut key list
de: Tastenkürzel

source: Information about this application
de: Informationen zu diesem Programm.

source: Break on var value
de: Stoppe gem. Variablenwert

source: Select index
de: Wähle Index

source: Show proc in source
de: Zeige Prozedur im Quelltext

source: Locate calling line
de: Lokalisiere die aufrufende Zeile

source: ASM code of proc
de: Assembler Quelltext e. Prozedur

source: Toggle Tracing
de: Verfolgung abbrechen

source: Cancel all Tracing
de: Alle Verfolgungen abbrechen

source: Delete
de: Lösche

source: Delete all
de: Lösche alles

source: Show var
de: Zeige Variable

source: Find text
de: Finde Text

source: Goto Line
de: Gehe zu Zeile

source: ASM data
de: ASM Daten

source: Line Address
de: Zeilenadresse

source: ASM code of line
de: ASM Quelltext der Zeile

source: ASM code of proc (from line)
de: ASN Quelltext der Prozedur (von Zeile)

source: Focus lines
de: Fokussiere Zeile

source: Add notes
de: Notizen hinzufügen

source: Mini command window
de: Kleines Kommando Fenster

source: Select EXE/BAS
de: EXE/BAS Datei auswählen

source: Select EXE/BAS file
de: Auswählen einer EXE oder BAS Datei

source: Tools
de: Werkzeuge

source: Some usefull....Tools
de: Einige hilfreiche....Werkzeuge

source: Open/close notes
de: Zeige/verberge Notizen

source: Open or close notes
de: Zeige/verberge Notizen

source: Select next thread to be executed
de: Wähle nächsten Thread

source: Show next executed line (source)
de: Zeige nächste Zeile (Source)

source: Show line creating thread (source)
de: Zeige Zeile des Threadaufrufs (Source)

source: Show first proc of thread (suorce)
de: Zeige erste Prozedur e. Thread (Quelltext)

source: Show proc (proc/var)
de: Zeige Prozeduren (Proc/Var)

source: Proc call Backtracking
de: Prozeduraufruf Rückverfolgung

source: Proc call Chaining
de: Prozeduraufruf Verkettung

source: Proc Adress
de: Prozedur Adresse

source: Kill thread
de: Stoppe Thread

source: Expand one thread
de: Öffne einen Thread

source: Collapse all threads
de: Schließe alle Threads

source: List all threads
de: Liste aller Threads

source: Settings
de: Einstellungen

source: Help
de: Hilfe

source: Launch tutorial
de: Starte Tutorial

source: Launch IDE
de: Starte Entwicklungsumgebung (IDE)

source: Quick edit
de: Schnellbearbeitung (quick edit)

source: Compile and run
de: Kompiliere und starte

source: Copy note to clipboard
de: Kopiere Notiz (Clipboard)

source: Show log file
de: Zeige Protokoll Datei

source: Hide log file
de: Verberge Protokoll

source: Delete log file
de: Lösche Protokoll Datei

source: List enum
de: ENUM Liste

source: Process list
de: Orozess Liste

source: DLLs list
de: DLL/.so Liste

source: Translate Win Message
de: Übersetze Fenster Nachricht

source: Show fast run timer
de: Zeige Zeitnehmer (fast run)

source: Settings (fbdbg)
de: Einstellungen (fbdbg)

source: _Background
de: _Hintergrund

source: Background
de: Hintergrund

source: Bkgr. cur. _line
de: Hintergrund akt. Zeile

source: Break_point
de: Halte_punkt

source: Breakpoint _tmp
de: Haltepunkt _tmp

source: Font for source view
de: Zeichensatz für das Quelltextfenster

source: Syntax _highlighting
de: Syntaxhervorhebung

source: Background current line
de: Hintergrund akt. Zeile

source: Breakpoint
de: Haltepunkte

source: Temporary Breakpoint
de: Temp. Haltepunkte

source: Keyword
de: Schlüsselworte

source: _Keywords
de: Schlüssel_worte

source: _Strings
de: _Zeichenketten

source: Strings
de: Zeichenketten

source: Preprocessors
de: Präprozessoren

source: Current line position
de: Aktuelle Zeilenposition

source: Comments
de: Kommentar

source: _Comments
de: Kommentar

source: Prepr_ocessors
de: Präpr_ozessoren

source: _Foreground
de: _Vordergrund

source: Foreground
de: Voredergrund

source: Line _numbers
de: Zeilen_nummern

source: Line numbers
de: Zeilennummern

source: Source View Appearance
de: Erscheinungsbild Quelltext

source: Use a file chooser dialog to select the FreeBASIC executable
de: Ein Dateiauswahlfenster zur Auswahl benutzen

source: Use a file chooser dialog to select the IDE executable
de: Ein Dateiauswahlfenster zur Auswahl benutzen

source: Tools location
de: Hilfsprogramme

source: Cmdline parameters
de: Kommandozeilenparameter

source: Screen
de: Bildschirm

source: Trace Line
de: Verf. Zeile

source: Trace Proc
de: Verf. Proc.

source: Log
de: Protokoll

source: Tooltips activated
de: Kurzhilfe aktiv

source: Verbose mode (ProcVar)
de: Ausführlich (ProcVar)

source: Delay value in [ms] for auto step mode (minimum 50, maximum 9999)
de: Wartezeit in [ms] zwischen den Steps der Funktion Schritt Modus (min. 50, max. 9999)

source: Shortcuts
de: Tastencode

source: General
de: Generell

source: Show/edit keybord shortcuts (fbdbg)
de: Zeige/bearbeite Tastenkodes (fbdbg)

source: Shurtcut
de: Tastenkode

source: Label
de: Beschriftung

source: Tooltip
de: Erklärung

source: Cur. line:
de: Akt. Zeile

source: Watch
de: Beobachte

source: ADDRESS
de: ADRESSE

source: Memory dump
de: Speicher auszug
